{
  "backend/main.mo": "Main Motoko actor for the StaySpread backend, defining data types and shared functions for user profiles, property listings, bookings, promoters, and Stripe checkout session management with role-based access control.",
  "feature_evidence.json": "Feature evidence report mapping the StaySpread deployment feature to its associated frontend files, backend components, and test IDs.",
  "frontend-file-summaries.txt": "JSON document containing one-sentence summaries of every frontend source file, serving as a reference index for the project's React components, pages, and hooks.",
  "frontend/index.css": "Global Tailwind CSS stylesheet defining OKLCH-based CSS custom properties for the light and dark color themes used throughout the application.",
  "frontend/index.html": "Root HTML entry point for the Vite/React app, including PWA meta tags, Apple touch icon, manifest link, and the mount point for the React application.",
  "frontend/public/manifest.json": "PWA web app manifest for StaySpread, specifying app name, theme colors, display mode, and a full set of icon sizes from 48px to 512px.",
  "frontend/src/App.tsx": "Root React component that configures TanStack Router with all application routes (home, listings, listing detail, host/promoter dashboards, payment success/failure) and wraps the app with ThemeProvider and QueryClientProvider.",
  "frontend/src/components/BookingForm.tsx": "Booking form component with check-in/check-out date pickers, nightly price calculation, and integration with booking and Stripe checkout session mutations to redirect users to Stripe.",
  "frontend/src/components/CreateListingForm.tsx": "A modal dialog form for creating a new property listing, handling image uploads, form validation, and submission via the useCreateListing hook.",
  "frontend/src/components/EditListingForm.tsx": "A modal dialog form for editing an existing property listing, pre-populating fields from the listing prop and submitting updates via the useUpdateListing hook.",
  "frontend/src/components/Footer.tsx": "A site footer component displaying branding, quick navigation links, and social media icons with a caffeine.ai attribution.",
  "frontend/src/components/Header.tsx": "A sticky site header with navigation links conditionally shown based on user role (host/promoter) and a login/logout button using Internet Identity.",
  "frontend/src/components/ImageGallery.tsx": "Displays a grid of property images with a lightbox dialog for full-size viewing and prev/next navigation between images.",
  "frontend/src/components/ListingCard.tsx": "A card component that displays a property listing's thumbnail, name, location, and price per night, linking to the listing detail page with an optional referral parameter.",
  "frontend/src/components/ProfileSetup.tsx": "A modal dialog that prompts newly authenticated users to create a profile by entering their name and selecting a role (traveler, host, or promoter).",
  "frontend/src/components/RootLayout.tsx": "The root layout wrapper that composes the Header, Footer, ProfileSetup modal, and renders child routes via an Outlet.",
  "frontend/src/components/StripeSetup.tsx": "A modal dialog component that prompts users to configure Stripe payments by entering a secret key and allowed countries, shown only when Stripe is not yet configured.",
  "frontend/src/hooks/useActor.ts": "A React Query hook that creates and caches an authenticated or anonymous ICP backend actor, initializing access control with an admin token and invalidating dependent queries when the identity changes.",
  "frontend/src/hooks/useBooking.ts": "A React Query mutation hook that calls the backend `createBooking` method with listing ID, check-in/out times, and an optional promoter code.",
  "frontend/src/hooks/useCheckout.ts": "A React Query mutation hook that creates a Stripe checkout session via the backend actor, returning the session ID and redirect URL.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and provider using DFINITY's AuthClient, exposing login/logout functions, identity state, and login status.",
  "frontend/src/hooks/useListings.ts": "React Query hooks for fetching property listings sorted by price and for creating, updating, and deleting listings via the backend actor.",
  "frontend/src/hooks/usePromoter.ts": "A React Query hook that fetches the caller's promoter referral code from the backend actor.",
  "frontend/src/hooks/useStripe.ts": "React Query hooks for checking whether Stripe is configured and for saving a new Stripe configuration via the backend actor.",
  "frontend/src/hooks/useUserProfile.ts": "React Query hooks for fetching and saving the authenticated caller's user profile via the backend actor.",
  "frontend/src/index.css": "Global CSS file that sets up Tailwind directives and defines CSS custom properties for light and dark theme color tokens.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with React Query and Internet Identity providers wrapping the root App component.",
  "frontend/src/pages/HomePage.tsx": "The home page component featuring a hero section, a 'How It Works' explainer with host/promoter/traveler cards, and a grid of featured property listings.",
  "frontend/src/pages/HostDashboard.tsx": "Dashboard page for authenticated hosts to view, create, edit, and delete their property listings, with Stripe setup integration and role-based access control.",
  "frontend/src/pages/ListingDetail.tsx": "Detail page for a single property listing showing images, description, amenities, and a booking form; supports referral codes via URL search params.",
  "frontend/src/pages/ListingsBrowse.tsx": "Browse page that fetches and displays all property listings in a responsive grid with skeleton loading states.",
  "frontend/src/pages/PaymentFailure.tsx": "Static page shown after a cancelled or failed payment, informing the user no charges were made and linking back to listings.",
  "frontend/src/pages/PaymentSuccess.tsx": "Static confirmation page displayed after a successful booking payment, with a link to browse more properties.",
  "frontend/src/pages/PromoterDashboard.tsx": "Dashboard for authenticated promoters to view and copy their referral link and see an earnings overview; enforces promoter role access.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL query parameters from both regular and hash-based routes, with sessionStorage fallback support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining a custom design system with OKLCH color tokens, border radius variables, accordion animations, and plugins for typography, container queries, and animate.",
  "project_state.json": "Tracks the overall state of the StaySpread project including architecture notes, existing features, known issues, and versioning metadata. Describes a short-term rental affiliate marketplace built with React/TypeScript, Motoko, Stripe, and Internet Identity."
}